#### HasNoValueFilterRule Members

---

|  |
| --- |
| HasNoValueFilterRule Class   Constructors   Methods   Properties   See Also |

The  HasNoValueFilterRule  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | HasNoValueFilterRule | constructs an instance of HasNoValueFilterRule. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  FilterRule  .) |
| Public method | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from  FilterRule  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from  FilterRule  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FilterRule  .) |
| Public property | Parameter | The parameter which will be evaluated to pass this rule. (Inherited from  ParameterValuePresenceRule  .) |

# See Also

HasNoValueFilterRule Class

Autodesk.Revit.DB Namespace